tutorials/multiphase/settlingFoam/ras/dahl/constant/polyMesh/boundary
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       15760;
    }
    outlet
    {
        type            patch;
        nFaces          4;
        startFace       15800;
    }
    bottomWall
    {
        type            patch;
        nFaces          200;
        startFace       15804;
    }
    endWall
    {
        type            wall;
        nFaces          36;
        startFace       16004;
    }
    top
    {
        type            patch;
        nFaces          200;
        startFace       16040;
    }
    frontAndBack
    {
        type            empty;
        nFaces          16000;
        startFace       16240;
    }
)

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
